eksperimen/VM 2 Load Tester/logs/combo_wrk.txt
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08s   528.28ms   1.99s    59.70%
    Req/Sec    19.51     13.79    60.00     60.39%
  1151 requests in 30.09s, 192.21KB read
  Socket errors: connect 0, read 0, write 0, timeout 1084
Requests/sec:     38.25
Transfer/sec:      6.39KB
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07s   526.64ms   1.98s    56.16%
    Req/Sec    17.42     12.31    60.00     63.11%
  1170 requests in 30.12s, 195.53KB read
  Socket errors: connect 0, read 0, write 0, timeout 1097
Requests/sec:     38.84
Transfer/sec:      6.49KB
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.02s   559.75ms   1.96s    58.11%
    Req/Sec    16.19     12.05    50.00     54.31%
  1131 requests in 30.10s, 188.87KB read
  Socket errors: connect 0, read 0, write 0, timeout 1057
Requests/sec:     37.58
Transfer/sec:      6.27KB
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03s   563.10ms   1.99s    57.33%
    Req/Sec    17.69     12.54    50.00     66.61%
  1138 requests in 30.06s, 190.04KB read
  Socket errors: connect 0, read 0, write 0, timeout 1063
Requests/sec:     37.85
Transfer/sec:      6.32KB
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04s   558.04ms   1.98s    57.53%
    Req/Sec    16.13     10.90    50.00     59.93%
  1128 requests in 30.05s, 188.37KB read
  Socket errors: connect 0, read 0, write 0, timeout 1055
Requests/sec:     37.54
Transfer/sec:      6.27KB
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77s   474.18ms   2.00s    86.06%
    Req/Sec    15.15     10.83    60.00     62.45%
  1303 requests in 30.10s, 217.59KB read
  Socket errors: connect 0, read 0, write 0, timeout 973
Requests/sec:     43.30
Transfer/sec:      7.23KB
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.58s   441.28ms   2.00s    76.19%
    Req/Sec    21.32     14.83    60.00     64.50%
  1353 requests in 30.08s, 225.94KB read
  Socket errors: connect 0, read 0, write 0, timeout 1248
Requests/sec:     44.97
Transfer/sec:      7.51KB
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   962.93ms  567.16ms   1.95s    57.14%
    Req/Sec    15.97     10.30    50.00     64.23%
  1151 requests in 30.07s, 192.21KB read
  Socket errors: connect 0, read 0, write 0, timeout 1067
Requests/sec:     38.27
Transfer/sec:      6.39KB
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01s   573.21ms   2.00s    54.43%
    Req/Sec    15.14     10.10    40.00     62.04%
  1146 requests in 30.06s, 191.37KB read
  Socket errors: connect 0, read 0, write 0, timeout 1067
Requests/sec:     38.12
Transfer/sec:      6.37KB
Running 30s test @ http://192.168.56.103:5004/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04s   528.77ms   1.97s    56.00%
    Req/Sec    18.75     13.49    60.00     63.88%
  1141 requests in 30.11s, 190.54KB read
  Socket errors: connect 0, read 0, write 0, timeout 1066
Requests/sec:     37.89
Transfer/sec:      6.33KB